<?php
do{
	$x1 = mt_rand(-100, 100);
	$y1 = mt_rand(-100, 100);
	$x2 = mt_rand(-100, 100);
	$y2 = mt_rand(-100, 100);
	$x3 = mt_rand(-100, 100);
	$y3 = mt_rand(-100, 100);
}
while(($y1 != $y2) || ($x2 != $x3));
echo "Координатаҳои қуллаи якӯми росткунҷа:";
echo "<br>x1 = ".$x1."<br>y1 = ".$y1;
echo "<br>Координатаҳои қуллаи дуюми росткунҷа:";
echo "<br>x2 = ".$x2."<br>y2 = ".$y2;
echo "<br>Координатаҳои қуллаи сеюми росткунҷа:";
echo "<br>x3 = ".$x3."<br>y3 = ".$y3;
if($x1 == $x2)
	$x4 = $x3;
else if($x1 == $x3)
	$x4 = $x2;
else
	$x4 = $x1;
if($y1 == $y2)
	$y4 = $y3;
else if($y1 == $y3)
	$y4 = $y2;
else
	$y4 = $y1;
echo "<br>Координатаҳои қуллаи чорӯми росткунҷа:";
echo "<br>x4 = ".$x4."<br>y4 = ".$y4;
?>