<?php
$a = mt_rand(1, 50);
$b = mt_rand(1, 50);
$S = $a * $b;
$P = 2 * ($a + $b);
echo "Первая сторона прямоугольника: ".$a;
echo "<br>Вторая сторона прямоугольника: ".$b;
echo "<br>Площадь прямоугольника: ".$S;
echo "<br>Периметр прямоугольника: ".$P;
?>

/*
<?php
$a = mt_rand(1, 50);
$b = mt_rand(1, 50);
$S = $a * $b;
$P = 2 * ($a + $b);
echo "Тарафи якӯми росткунҷа: ".$a;
echo "<br>Тарафи дуюми росткунҷа: ".$b;
echo "<br>Масоҳати росткунҷа: ".$S;
echo "<br>Периметри росткунҷа: ".$P;
?>
*/