<?php
$a = mt_rand(1, 50);
$b = mt_rand(1, 50);
$c = mt_rand(1, 50);
$V = $a * $b * $c;
$S = 2 * ($a*$b + $b*$c + $a*$c);
echo "Длина первого ребра: ".$a;
echo "<br>Длина второго ребра: ".$b;
echo "<br>Длина третьего ребра: ".$c;
echo "<br>Объем прямоугольного параллелопипеда: ".$V;
echo "<br>Площадь поверхности: ".$S;
?>

/*
<?php
$a = mt_rand(1, 50);
$b = mt_rand(1, 50);
$c = mt_rand(1, 50);
$V = $a * $b * $c;
$S = 2 * ($a*$b + $b*$c + $a*$c);
echo "Дарозии рӯяи якӯм: ".$a;
echo "<br>Дарозии рӯяи дуюм: ".$b;
echo "<br>Дарозии рӯяи сеюм: ".$c;
echo "<br>Ҳаҷми параллелопипед: ".$V;
echo "<br>Масоҳати сатҳи болоӣ: ".$S;
?>
*/