<?php
$V1 = mt_rand(1, 100);
$V2 = mt_rand(1, 100);
$s = mt_rand(1, 100);
$T = mt_rand(1, 100);
$S = abs($s - ($V1 + $V2) * $T);
echo "Скорость первой машины: ".$V1;
echo "<br>Скорость второй машины: ".$V2;
echo "<br>Начальное расстояние: ".$s;
echo "<br>Проведенное время: ".$T;
echo "<br>Итоговое расстояние: ".$S;
?>

/*
<?php
$V1 = mt_rand(1, 100);
$V2 = mt_rand(1, 100);
$s = mt_rand(1, 100);
$T = mt_rand(1, 100);
$S = abs($s - ($V1 + $V2) * $T);
echo "Суръати мошини якӯм: ".$V1;
echo "<br>Суръати мошини дуюм: ".$V2;
echo "<br>Масофаи аввала: ".$s;
echo "<br>Вақти сарфшуда: ".$T;
echo "<br>Масофаи ниҳоӣ: ".$S;
?>
*/