<?php
do{
	$V = mt_rand(1, 100);
	$U = mt_rand(1, 100);
}
while($V <= $U);
$T1 = mt_rand(1, 100);
$T2 = mt_rand(1, 100);
echo "Скорость лодки в стоячей воде: ".$V;
echo "<br>Скорость течения реки: ".$U;
echo "<br>Время движения лодки по озеру: ".$T1;
echo "<br>Время движения лодки по реке: ".$T2;
$S = $V * $T1 + ($V - $U) * $T2;
echo "<br>Проведенный путь лодки: ".$S;
?>

/*
<?php
do{
	$V = mt_rand(1, 100);
	$U = mt_rand(1, 100);
}
while($V <= $U);
$T1 = mt_rand(1, 100);
$T2 = mt_rand(1, 100);
echo "Суръати киштӣ дар кӯл: ".$V;
echo "<br>Суръати ҷараёни дарё: ".$U;
echo "<br>Вақти сарфшуда дар кӯл: ".$T1;
echo "<br>Вақти сарфшуда дар дарё: ".$T2;
$S = $V * $T1 + ($V - $U) * $T2;
echo "<br>Роҳи тайкардаи киштӣ: ".$S;
?>
*/